{"scribblenauts_":{"text":"Scribblenauts is the first entry in the unique Scribblenauts series, where the player can summon anything into a level, and is arguably the glitchiest. To go fast in this game, the runner makes judicious use of these glitches, most of which clip the player or objects through geometry, and attempts to find increasingly optimal solutions for each level.","platform":"DS"},"superscribblenauts":{"text":"Super Scribblenauts is the sequel to Scribblenauts, and features fewer glitches and more summoning options. To go fast in this game, the runner mostly types the shortest solution to each level as fast as possible, and uses the occasional glitch to bypass some challenges.","platform":"DS"},"kss":{"text":"Kirby Super Star, also known as Kirby's Fun Pak in PAL regions and Hoshi no Kirby Super Deluxe/SDX in Japan, is a unified collection of Kirby games, most of which must be played to reach the credits. To go fast in this game, the runner uses various abilities that optimize Kirby's movement speed, skips or quick-kills minibosses, and does a host of other smooth moves.","platform":"SNES"},"m2":{"text":"Metroid II: Return of Samus is the second installment in the 2D Metroid series, adding the ability to aim down, the ability to quickly refill missiles and health, and the privilege of starting at 99 energy. To go fast in this game, the runner collects the Varia suit, exploits a quirk in Spider Ball's physics that allows for fast leftward movement, and uses damage boosts for extra jumps.","platform":"Game Boy"},"bomberman_ds":{"text":"Bomberman DS is a top-down perspective 2D game where the player uses bombs that explode in a cross shape to destroy soft blocks and damage enemies. To go fast in this game, the runner collects useful items during play for use on difficult stages and bosses. These items include: Remote Control, Heart, Invincible, and Power Glove.","platform":"DS"},"bomberman_2_ds":{"text":"Bomberman 2 DS is a top-down perspective 2D game where the player uses bombs that explode in a cross shape to destroy soft blocks and damage enemies. To go fast in this game, the runner acquires and equips combinations of 'parts' for Bomberman that allow for the fastest completion of individual tasks.","platform":"DS"},"wl1":{"text":"Wario Land: Super Mario Land 3 is a spinoff platformer that takes place after Super Mario Land 2, and launched its own series Wario Land games. To go fast in this game, the runner uses the Jet Hat, which allows for smooth continuous dashes through levels, and high jumps, which have faster horizontal velocity than normal jumps.","platform":"Game Boy"},"vbwl":{"text":"Virtual Boy Wario Land is a platformer, and is the sequel to Wario Land: Super Mario Land 3, from which it partially borrows the powerup system. To go fast in this game, the runner uses one of two powerups that allow for fast dash maneuvers, particularly the Eagle Hat, which allows dashing and dashjumping in midair.","platform":"Virtual Boy"},"wl2":{"text":"Wario Land 2 is a platformer originally released for the monochrome Gameboy, but shortly was recolored and rereleased for the Gameboy Color. To go fast in this game, the runner cuts corners and uses dashes or dashjumps to traverse the levels as quickly as possible. This game has similar physics to Wario Land 3.","platform":"Game Boy Color"},"wl3":{"text":"Wario Land 3 is a non-linear puzzle platformer, and is considered one of the high points in the series. To go fast in this game, the runner uses dashjumps sparingly, and collects treasures in an optimal order in order. This may involve using wall clips, an important exploit that builds on a similar glitch in Wario Land 2.","platform":"Game Boy Color"},"wl4":{"text":"Wario Land 4 is currently the last Wario Land game with a number in it, and is considered one of the high points in the series. To go fast in this game, the runner uses some movement quirks that allow Wario to stay at a high speed, attempting to take the shortest loop through the level while collecting all required items.","platform":"Game Boy Advance"},"warios_woods_nes":{"text":"Wario's Woods is a puzzle game in which Toad moves wriggling monsters around with his bare hands and eradicates them with bombs; the goal being to eliminate all monsters before running out of space. To go fast in this game, the runner memorizes various patterns and maneuvers, tries to prevent the game from entering crazy mode, and mines diamonds by destroying 5-in-a-rows.","platform":"NES"},"wwoods":{"text":"Wario's Woods is a puzzle game in which Toad moves writhing monsters around with his bare hands and eradicates them with bombs; the goal being to eliminate all monsters before running out of space. To go fast in this game, the runner memorizes various patterns and maneuvers, tries to prevent the game from entering crazy mode, and mines diamonds by destroying 5-in-a-rows.","platform":"SNES"}}