{"scribblenauts_":{"name":"Scribblenauts","text":" is the first entry in the unique Scribblenauts series, where the player can summon anything into a level, and is arguably the glitchiest. To go fast in this game, the runner makes judicious use of these glitches, most of which clip the player or objects through geometry, and attempts to find increasingly optimal solutions for each level.","platform":"DS","pb":"any% 13:30, Any% no-repeat 20:15","reset":"Suggestion noted."},"superscribblenauts":{"name":"Super Scribblenauts","text":" is the sequel to Scribblenauts, and features fewer glitches and more summoning options. To go fast in this game, the runner mostly types the shortest solution to each level as fast as possible, and uses the occasional glitch to bypass some challenges.","platform":"DS","pb":"none NotLikeThis","reset":"Suggestion noted."},"kss":{"name":"Kirby Super Star","text":", also known as Kirby's Fun Pak in PAL regions and Hoshi no Kirby Super Deluxe/SDX in Japan, is a unified collection of Kirby games, most of which must be played to reach the credits. To go fast in this game, the runner uses various abilities that optimize Kirby's movement speed, skips or quick-kills minibosses, and does a host of other smooth moves.","platform":"SNES","pb":"any% around 1:00, 100% SS around 1:25-1:30(?)","reset":"Suggestion noted."},"m2":{"name":"Metroid II: Return of Samus","text":" is the second installment in the 2D Metroid series, adding the ability to aim down, the ability to quickly refill missiles and health, and the privilege of starting at 99 energy. To go fast in this game, the runner collects the Varia suit, exploits a quirk in Spider Ball's physics that allows for fast leftward movement, and uses damage boosts for extra jumps.","platform":"Game Boy","pb":"any% no OoB 2:16:03","reset":"Suggestion noted."},"bomberman_ds":{"name":"Bomberman DS","text":" is a top-down perspective 2D game where the player uses bombs that explode in a cross shape to destroy soft blocks and damage enemies. To go fast in this game, the runner collects useful items during play for use on difficult stages and bosses. These items include: Remote Control, Heart, Invincible, and Power Glove.","platform":"DS","pb":"\"Story Mode\" 1:47:17 (no video NotLikeThis ), All Battle Stages 1:01:13","reset":"Suggestion noted."},"bomberman_2_ds":{"name":"Bomberman 2 (DS)","text":" is a top-down perspective 2D game where the player uses bombs that explode in a cross shape to destroy soft blocks and damage enemies. To go fast in this game, the runner acquires and equips combinations of 'parts' for Bomberman that allow for the fastest completion of individual tasks.","platform":"DS","pb":"none NotLikeThis","reset":"Suggestion noted."},"wl1":{"name":"Wario Land: Super Mario Land 3","text":" is a spinoff platformer that takes place after Super Mario Land 2, and launched its own series of Wario Land games. To go fast in this game, the runner uses the Jet Hat, which allows for smooth continuous dashes through levels, and high jumps, which have faster horizontal velocity than normal jumps.","platform":"Game Boy","pb":"Any% 24:35, All Treasures 54:32, Powerless 33:25; assorted 2nd-4th place times","reset":"I think I already reset enough."},"vbwl":{"name":"Virtual Boy Wario Land","text":" is a platformer, and is the sequel to Wario Land: Super Mario Land 3, from which it partially borrows the powerup system. To go fast in this game, the runner uses one of two powerups that allow for fast dash maneuvers, particularly the Eagle Hat, which allows dashing and dashjumping in midair.","platform":"Virtual Boy","pb":"any% 21:59 IGT/23:23 RTA","reset":"I reset if I feel that it is absolutely impossible to PB."},"wl2":{"name":"Wario Land II","text":" is a platformer originally released for the monochrome Gameboy, but shortly after was recolored. To go fast in this game, the runner cuts corners and uses dashes or dashjumps to traverse the levels as quickly as possible. This game has similar physics to Wario Land 3.","platform":"Game Boy Color","pb":"Any% Glitchless 8:38, Main Story Glitchless 35:39, All Levels Glitchless 1:12:10, random meme runs","reset":"Do you really want to sit through the cutscenes again?"},"wl3":{"name":"Wario Land 3","text":" is a non-linear puzzle platformer, and is considered one of the high points in the series. To go fast in this game, the runner uses dashjumps sparingly, and collects treasures in an optimal order to minimize overworld travel. This may involve using wall clips, an important exploit that builds on a similar glitch in Wario Land 2.","platform":"Game Boy Color","pb":"Any% 50:38, Any% NMS 1:23:33, Any% Glitchless 1:19:55, Any% NG+ (meme category) 35:49, All Chests 2:50:39, 100% 4:00:32","reset":"Suggestion noted."},"wl4":{"name":"Wario Land 4","text":" is currently the last Wario Land game with a number in it, and is considered one of the high points in the series. To go fast in this game, the runner uses some movement quirks that allow Wario to stay at a high speed, attempting to take the shortest loop through the level while collecting all required items.","platform":"Game Boy Advance","pb":"Any% Normal Zipless 1:03:05, 100% Normal Zipless 2:38:25 (bad)","reset":"What do you mean? I'm resetting after every level!"},"warios_woods_nes":{"name":"Wario's Woods","text":" is a puzzle game featuring Toad, bombs, and wriggling monsters. To go fast in this game, the runner memorizes various patterns and maneuvers, tries to prevent the game from entering crazy mode, and mines diamonds by destroying 5-in-a-rows.","platform":"NES","pb":"99R Type A 2:41:32 (needs work)","reset":"Suggestion noted."},"wwoods":{"name":"Wario's Woods","text":" is a puzzle game in which Toad moves around enemies and bombs; the goal being to eliminate all monsters before running out of space. To go fast in this game, the runner memorizes various patterns and maneuvers, and tries to prevent the game from entering crazy mode.","platform":"SNES","pb":"none NotLikeThis","reset":"Suggestion noted."}}